src/DataProcessors/Scan_РММенеджераПоКонтролюЗаказов/Scan_РММенеджераПоКонтролюЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Scan_РММенеджераПоКонтролюЗаказов</name>
</mdclass:DataProcessor>

src/Catalogs/Scan_ЗаказыНаЗавод/Scan_ЗаказыНаЗавод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ЗаказыНаЗавод</name>
  <comment>Предварительно справочник</comment>
  <attributes>
    <name>DDDeviation</name>
    <type>
      <types>CatalogRef.Scan_ПричиныОтклоненийПоDD</types>
    </type>
  </attributes>
  <attributes>
    <name>DDPriority</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГотовностьТС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаБукингЛиста</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьБукингЛист</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойСтатусЗаказа</name>
    <type>
      <types>CatalogRef.Scan_ЗаводскиеСтатусыЗаказаНаЗавод</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказчикCOW</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказыНаЗакупкуOFMSПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказыНаЗакупкуПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодАдресаДоставки</name>
    <type>
      <types>CatalogRef.Scan_КодыАдресовДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Кузовостроитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КузовщикиПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроизводства</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НапоминаниеДилерамОтправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерБукингЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродавецЗаказчика</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаказыНаЗакупку</name>
    <attributes>
      <name>Кузовщик</name>
      <type>
        <types>CatalogRef.Scan_Контрагенты</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаЗакупку</name>
      <type>
        <types>String</types>
        <types>DocumentRef.Scan_ЗаказНаЗакупку</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Основной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/Scan_РММенеджераПоКонтролюЗаказов/Forms/ФормаВыбораКузовостроителя/Module.bsl
// Rarus tenkam 28.06.2022 mantis 18726 АПК + (Стандартные области)
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВыбранныеЗаказыНаЗавод") Тогда		
		ВыбранныеЗаказыНаЗавод = Параметры.ВыбранныеЗаказыНаЗавод;
		// rarus kabany 18.06.2021 17886 +++
		КолВоЗаказовНаЗавод = ВыбранныеЗаказыНаЗавод.Количество();
		//Если ВыбранныеЗаказыНаЗавод.Количество() > 0 Тогда
		Если КолВоЗаказовНаЗавод > 0 Тогда
	    // rarus kabany 18.06.2021 17886 ---
			Для каждого заказ из ВыбранныеЗаказыНаЗавод ЦИКЛ 
				НоваяСтрока = ЗаказыНаЗавод.Добавить();
				НоваяСтрока.Ссылка = заказ;
			КонецЦикла;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	МАКСИМУМ(Scan_ЗаказыНаЗаводЗаказыНаЗакупку.Основной) КАК Основной,
			|	МАКСИМУМ(Scan_ЗаказыНаЗаводЗаказыНаЗакупку.ПорядковыйНомер) КАК ПорядковыйНомер,
			|	Scan_ЗаказыНаЗаводЗаказыНаЗакупку.Кузовщик КАК Кузовщик,
			|	Scan_ЗаказыНаЗаводЗаказыНаЗакупку.ЗаказНаЗакупку КАК ЗаказНаЗакупку,
			// rarus kabany 17.06.2021 17886 +++
			| Scan_ЗаказыНаЗаводЗаказыНаЗакупку.ЗаказНаЗакупку.ДОНомерЗаказаНаЗакупку КАК ЗаказНаЗакупкуДОНомерЗаказаНаЗакупку,
			// rarus kabany 17.06.2021 17886 ---
			// rarus kabany 18.06.2021 17886 +
			|	КОЛИЧЕСТВО(Scan_ЗаказыНаЗаводЗаказыНаЗакупку.Ссылка) КАК КоличествоОдинаковых
			|ПОМЕСТИТЬ ВТ
			// rarus kabany 18.06.2021 17886 -
			|ИЗ
			|	Справочник.Scan_ЗаказыНаЗавод.ЗаказыНаЗакупку КАК Scan_ЗаказыНаЗаводЗаказыНаЗакупку
			|ГДЕ
			|	Scan_ЗаказыНаЗаводЗаказыНаЗакупку.Ссылка В(&ВыбранныеЗаказыНаЗавод)
			|
			|СГРУППИРОВАТЬ ПО
			|	Scan_ЗаказыНаЗаводЗаказыНаЗакупку.ЗаказНаЗакупку,
			|	Scan_ЗаказыНаЗаводЗаказыНаЗакупку.Кузовщик,
			// rarus kabany 17.06.2021 17886 +++
			| Scan_ЗаказыНаЗаводЗаказыНаЗакупку.ЗаказНаЗакупку.ДОНомерЗаказаНаЗакупку
			|;
			// rarus kabany 17.06.2021 17886 ---
			// rarus kabany 17.06.2021 17886 +++
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ.Основной КАК Основной,
			|	ВТ.ПорядковыйНомер КАК ПорядковыйНомер,
			|	ВТ.Кузовщик КАК Кузовщик,
			|	ВТ.ЗаказНаЗакупку КАК ЗаказНаЗакупку,
			|   ВТ.ЗаказНаЗакупку.ДОНомерЗаказаНаЗакупку КАК ЗаказНаЗакупкуДОНомерЗаказаНаЗакупку
			|ИЗ
			|	ВТ КАК ВТ
			|ГДЕ
			|	ВТ.КоличествоОдинаковых = &КолВоЗаказовНаЗавод";
			
			Запрос.УстановитьПараметр("КолВоЗаказовНаЗавод", КолВоЗаказовНаЗавод);
			// rarus kabany 17.06.2021 17886 ---			
			Запрос.УстановитьПараметр("ВыбранныеЗаказыНаЗавод", Параметры.ВыбранныеЗаказыНаЗавод);					
			ТЗ = Запрос.Выполнить().Выгрузить();
			ЗаказыНаЗакупку.Очистить();
			ЗаказыНаЗакупку.Загрузить(ТЗ);
			
			ПараметрыОтбора = Новый Структура("Основной",Истина);
			МассивОсновныхСтрок = ЗаказыНаЗакупку.НайтиСтроки(ПараметрыОтбора);
			Если МассивОсновныхСтрок.Количество() > 1 Тогда
				ВывестиСообщениеПол(СтрШаблон(НСтр("ru = 'В таблице несколько строк с признаком ""Основной""!'; en = 'There are several lines in the table with the ""Basic"" attribute!'"))); 			
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
	// Rarus tenkam 15.12.2021 mantis 18574 +++
	Если Параметры.Свойство("ОсновнойКузовостроитель") Тогда
		ОсновнойКузовостроитель = Параметры.ОсновнойКузовостроитель;
		Элементы.ЗаказыНаЗакупкуОсновной.ТолькоПросмотр = НЕ ОсновнойКузовостроитель;
	КонецЕсли;
	
	Если Параметры.Свойство("ПорядковыйНомерКузовостроителя") Тогда
		ПорядковыйНомерКузовостроителя = Параметры.ПорядковыйНомерКузовостроителя;
		Элементы.ЗаказыНаЗакупкуПорядковыйНомер.ТолькоПросмотр = НЕ ПорядковыйНомерКузовостроителя;    		
	КонецЕсли;    	
	// Rarus tenkam 15.12.2021 mantis 18574 ---
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗаказыНаЗакупкуОсновнойПриИзменении(Элемент)
	ПараметрыОтбора = Новый Структура("Основной",Истина);
	МассивОсновныхСтрок = ЗаказыНаЗакупку.НайтиСтроки(ПараметрыОтбора);
	Если МассивОсновныхСтрок.Количество() > 1 Тогда
		ТекущиеДанные = Элементы.ЗаказыНаЗакупку.ТекущиеДанные;
		ТекущиеДанные.Основной = Ложь;
		ВывестиСообщениеПол(Нстр("ru = 'В таблице уже есть строка с признаком ""Основной""'"));
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыНаЗакупкуПорядковыйНомерПриИзменении(Элемент) // Rarus tenkam 15.12.2021 mantis 18574 +++
	ТекущиеДанные = Элементы.ЗаказыНаЗакупку.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда     		
		ПараметрыОтбора = Новый Структура("ПорядковыйНомер", ТекущиеДанные.Порядковыйномер);
		МассивОсновныхСтрок = ЗаказыНаЗакупку.НайтиСтроки(ПараметрыОтбора);
		Если МассивОсновныхСтрок.Количество() > 1 Тогда
			ТекущиеДанные.ПорядковыйНомер = 0;
			ВывестиСообщениеПол(Нстр("ru = 'В таблице уже есть строка с указанным порядковым номером.'"));
		КонецЕсли;
	КонецЕсли;             		
КонецПроцедуры // Rarus tenkam 15.12.2021 mantis 18574 ---

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	// Rarus tenkam 15.12.2021 mantis 18574 +++
	Если ОсновнойКузовостроитель Тогда
	// Rarus tenkam 15.12.2021 mantis 18574 ---
		
		ПараметрыОтбора = Новый Структура("Основной",Истина);
		МассивОсновныхСтрок = ЗаказыНаЗакупку.НайтиСтроки(ПараметрыОтбора);
		Если МассивОсновныхСтрок.Количество() > 1 Тогда
			ВывестиСообщениеПол(СтрШаблон(НСтр("ru = 'В таблице несколько строк с признаком ""Основной"", запись не возможна!'; en = 'There are several lines in the table with the attribute ""Main"", recording is not possible!'"))); 			
			Возврат;
		ИначеЕсли МассивОсновныхСтрок.Количество() = 0 Тогда
			ВывестиСообщениеПол(СтрШаблон(НСтр("ru = 'В таблице не выбрано ни одной строки с признаком ""Основной"", пожалуйста выберите строку!'; en = 'There are no lines with the ""Main"" flag selected in the table, please select a line!'"))); 			
			Возврат;
		КонецЕсли;
		
		УстановитьОсновногоКузовостроителяСервер();
	// Rarus tenkam 15.12.2021 mantis 18574 +++
	КонецЕсли; 
	
	Если ПорядковыйНомерКузовостроителя Тогда
		ЕстьОшибки = Ложь;
		ЕстьЗаполненные = Ложь;
		Для Каждого ТекСтрока Из ЗаказыНаЗакупку Цикл
			Если ТекСтрока.ПорядковыйНомер <> 0 Тогда
				ЕстьЗаполненные = Истина;
				//Прервать;
				Если НЕ ЭтоКузовостроитель(ТекСтрока.Кузовщик) Тогда
					ВывестиСообщениеПол(СтрШаблон(НСтр("ru = '%1 не является кузовостроителем! У него не может быть установлен порядковый номер.'; en = '%1 is not a bodybuilder!'"),ТекСтрока.Кузовщик)); 			
				    ЕстьОшибки = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьОшибки Тогда
			Возврат;
		КонецЕсли;		
		Если НЕ ЕстьЗаполненные Тогда
			ВывестиСообщениеПол(СтрШаблон(НСтр("ru = 'В таблице не указан ни один порядковый номер, пожалуйста внесите данные!'; en = 'There are no lines with the ""index"" selected in the table, please select a line!'"))); 			
			Возврат;
		КонецЕсли;
		
		УстановитьПорядковыйНомерСервер();
	КонецЕсли;
	// Rarus tenkam 15.12.2021 mantis 18574 ---	
	
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОсновногоКузовостроителяСервер()
	
	ПараметрыОтбора = Новый Структура("Основной",Истина);
	ОсновнойКузовостроительСтроки = ЗаказыНаЗакупку.НайтиСтроки(ПараметрыОтбора); // Rarus tenkam 23.03.2022 mantis 18574 +- переименовала ОсновнойКузовостроитель 
	
	ВсеОк = Истина;
	
	ПараметрыОтбораОбъект = Новый Структура("ЗаказНаЗакупку", ОсновнойКузовостроительСтроки[0].ЗаказНаЗакупку);
	СтрокаЗаказов = "";
	Для каждого заказ из ЗаказыНаЗавод ЦИКЛ 
		СтрокаЗаказов = СтрокаЗаказов + Строка(заказ.ссылка)+" ";
		ЗаказНаЗаводОбъект = заказ.ссылка.ПолучитьОбъект();
		ЗаказНаЗаводОбъект.Заблокировать();   // rarus kabany Дата: 14/07/2021 ++ АПК // добавил блокировку		
		ЗаказыНаЗакупкуОбъект = ЗаказНаЗаводОбъект.ЗаказыНаЗакупку;
		ОсновнойКузовостроительОбъект = ЗаказыНаЗакупкуОбъект.НайтиСтроки(ПараметрыОтбораОбъект);
		ОсновнойКузовостроительОбъект[0].Основной = Истина;		
		Попытка			
			ЗаказНаЗаводОбъект.Записать();                               
		Исключение
			ВсеОк = Ложь;
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции прервано!'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); // Rarus tenkam 28.06.2022 mantis 18726 АПК + (Код основного языка)
			Сообщить(СтрШаблон(НСтр("ru = 'Произошла ошибка при установке флага ""Основной кузовостроитель"" для следующих заказов: %1 (подробности см. в журанле регистрации)'; en = 'An error occured while setting the ""Main bodybuilder"" flag for the following orders: %1 (see registration log for details)'"),СтрокаЗаказов)); 					
			ВызватьИсключение;
			
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПорядковыйНомерСервер() // Rarus tenkam 15.12.2021 mantis 18574 +++
	
	ВсеОк = Истина;
	
	СтрокаЗаказов = "";
	Для Каждого Заказ из ЗаказыНаЗавод Цикл 
		СтрокаЗаказов = СтрокаЗаказов + Строка(Заказ.ссылка)+" ";
		ЗаказНаЗаводОбъект = Заказ.Ссылка.ПолучитьОбъект();
		ЗаказНаЗаводОбъект.Заблокировать();		
		ЗаказыНаЗакупкуТЧ = ЗаказНаЗаводОбъект.ЗаказыНаЗакупку;
		Для Каждого ТекЗаказНаЗакупкуСтрока Из ЗаказыНаЗакупку Цикл
			ПараметрыОтбора = Новый Структура("ЗаказНаЗакупку", ТекЗаказНаЗакупкуСтрока.ЗаказНаЗакупку);
			МассивСтрок = ЗаказыНаЗакупкуТЧ.НайтиСтроки(ПараметрыОтбора);	
			Если МассивСтрок.Количество() <> 0 Тогда
				ТекСтрокаВЗаказе = МассивСтрок[0];
				ТекСтрокаВЗаказе.ПорядковыйНомер = ТекЗаказНаЗакупкуСтрока.ПорядковыйНомер;
			КонецЕсли;
		КонецЦикла;
		Попытка			
			ЗаказНаЗаводОбъект.Записать();
		Исключение
			ВсеОк = Ложь;
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции прервано!'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); // Rarus tenkam 28.06.2022 mantis 18726 АПК + (Код основного языка)
			Сообщить(СтрШаблон(НСтр("ru = 'Произошла ошибка при установке порядкового номера для следующих заказов: %1 (подробности см. в журанле регистрации)'; en = 'An error occured while setting the index number for the following orders: %1 (see registration log for details)'"),СтрокаЗаказов)); 					
			ВызватьИсключение;
			
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры // Rarus tenkam 15.12.2021 mantis 18574 ---

&НаСервереБезКонтекста
Функция ЭтоКузовостроитель(ТекКонтрагент) // Rarus tenkam 22.04.2022 mantis 18574 +
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекКонтрагент, "Кузовостроитель");	
КонецФункции

#КонецОбласти
